-- 생성 과제
-- - 초급
    
--     (1) **`customers`** 테이블에 새 고객을 추가하세요.
    
--     (2) **`products`** 테이블에 새 제품을 추가하세요.
    
--     (3) **`employees`** 테이블에 새 직원을 추가하세요.
    
--     (4) **`offices`** 테이블에 새 사무실을 추가하세요.
    
--     (5) **`orders`** 테이블에 새 주문을 추가하세요.
    
--     (6) **`orderdetails`** 테이블에 주문 상세 정보를 추가하세요.
    
--     (7) **`payments`** 테이블에 지불 정보를 추가하세요.
    
--     (8) **`productlines`** 테이블에 제품 라인을 추가하세요.
    
--     (9) **`customers`** 테이블에 다른 지역의 고객을 추가하세요.
    
--     (10) **`products`** 테이블에 다른 카테고리의 제품을 추가하세요.


-- - 중급
    
--     (1) **`customers`** 테이블에 여러 고객을 한 번에 추가하세요.
    
--     (2) **`products`** 테이블에 여러 제품을 한 번에 추가하세요.
    
--     (3) **`employees`** 테이블에 여러 직원을 한 번에 추가하세요.
    
--     (4) **`orders`**와 **`orderdetails`**에 연결된 주문을 한 번에 추가하세요.
    
--     (5)**`payments`** 테이블에 여러 지불 정보를 한 번에 추가하세요.
    
--     (6) **`customers`** 테이블에 고객을 추가하고 바로 주문을 추가하세요.
    
--     (7) **`employees`** 테이블에 직원을 추가하고 바로 직급을 할당하세요.
    
--     (8) **`products`** 테이블에 제품을 추가하고 바로 재고를 업데이트하세요.
    
--     (9) **`offices`** 테이블에 새 사무실을 추가하고 바로 직원을 할당하세요.
    
--     (10) **`productlines`** 테이블에 제품 라인을 추가하고 바로 여러 제품을 추가하세요.


-- - 고급
    
--     (1) **`customers`** 테이블에 새 고객을 추가하고 바로 주문을 추가하세요.
    
--     (2) **`employees`** 테이블에 새 직원을 추가하고 바로 그들의 매니저를 업데이트하세요.
    
--     (3) **`products`** 테이블에 새 제품을 추가하고 바로 그 제품에 대한 주문을 추가하세요.
    
--     (4) **`orders`** 테이블에 새 주문을 추가하고 바로 지불 정보를 추가하세요.
    
--     (5)**`orderdetails`** 테이블에 주문 상세 정보를 추가하고 바로 관련 제품의 재고를 감소시키세요.

-- 읽기 과제
-- 초급 10문제
-- 중급 10문제
-- 고급 5문제

-- 갱신 과제
-- 초급 10문제
-- 중급 10문제
-- 고급 5문제

-- 삭제 과제
-- 초급 10문제
-- 중급 10문제
-- 고급 5문제

